  
   
      Pseudo-Wire Edge-to-Edge(PWE3)                      Thomas D. Nadeau 
      Internet Draft                                        Monique Morrow 
      Expiration Date: January 2005                          Cisco Systems 
                                                                           
                                                          Peter Busschbach 
                                                       Lucent Technologies 
                                                                           
                                                         Mustapha Aissaoui 
                                                                   Alcatel 
                                                                           
                                                                   Editors 
                                                                           
                                                                 July 2004 
                                                                           
      
      
                    Pseudo Wire (PW) OAM Message Mapping  
                     draft-ietf-pwe3-oam-msg-map-00.txt 
      
      
      
   Status of this Memo 
      
     This document is an Internet-Draft and is in full conformance with 
     all provisions of Section 10 of RFC 2026. 
      
     Internet-Drafts are working documents of the Internet Engineering 
     Task Force (IETF), its areas, and its working groups. Note that 
     other groups may also distribute working documents as Internet-
     Drafts. 
      
     Internet-Drafts are draft documents valid for a maximum of six 
     months and may be updated, replaced, or obsoleted by other 
     documents at any time. It is inappropriate to use Internet-Drafts 
     as reference material or to cite them other than as "work in 
     progress."  
      
     The list of current Internet-Drafts can be accessed at 
     http://www.ietf.org/ietf/1id-abstracts.txt. 
      
  Abstract 
      
     This document enumerates the OAM defect state mapping from pseudo 
     wire emulated edge-to-edge services over MPLS and IP transport 
     networks to their native attached services. 
      
      
  Table of Contents 
      
     Status of this Memo.............................................1 
     Abstract........................................................1 
     Table of Contents...............................................1 
     1 Conventions used in this document.............................2 
   
  Nadeau, et al.           Expires January 2005                 [Page 1]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     2 Contributors..................................................3 
     3 Scope.........................................................3 
     4 Terminology...................................................3 
     5 Introduction..................................................4 
     6 Reference Model and Defect Locations..........................4 
     7 PW Status and Defects.........................................5 
      7.1 PW Defects.................................................5 
         7.1.1 Packet Loss...........................................6 
      7.2 Defect Detection...........................................6 
         7.2.1 Defect Detection Tools................................6 
         7.2.2 Defect Detection Mechanism Applicability..............7 
      7.3 PW Defect Entry and Exit Procedures........................7 
         7.3.1 PW Down...............................................8 
         7.3.2 PW Up.................................................8 
      7.4 Alarm Messages and Consequent Actions......................9 
      7.5 The Use of PW Status.......................................9 
      7.6 The Use of L2TP SCCN and CDN..............................10 
      7.7 The Use of BFD Diagnostic Codes...........................10 
     8 Frame Relay Encapsulation....................................11 
      8.1 Frame Relay Management....................................11 
      8.2 Mapping of Defect States from a PW to a Frame Relay AC....12 
         8.2.1 Procedures in FR Port Mode...........................13 
      8.3 Frame Relay Network and Attachment Circuit Defects........13 
     9 ATM Encapsulation............................................13 
      9.1 ATM Management............................................13 
      9.2 Mapping ATM and PW Defect States..........................14 
      9.3 Mapping of Defect States from a PW to a ATM AC............15 
         9.3.1 Inband ATM OAM over PW...............................15 
         9.3.2 Out-of-Band ATM OAM over PW..........................15 
         9.3.3 Procedures in ATM Port Mode..........................16 
      9.4 ATM Network and Attachment Circuit Defects................17 
         9.4.1 Inband ATM OAM over PW...............................17 
         9.4.2 Out-of-Band ATM OAM over PW..........................17 
         9.4.3 Procedures in ATM Port Mode..........................18 
     10 SONET Encapsulation (CEP)...................................18 
     11 TDM Encapsulation...........................................18 
     12 Ethernet Encapsulation......................................19 
     13 Security Considerations.....................................20 
     14 Acknowledgments.............................................20 
     15 References..................................................20 
     16 Intellectual Property Disclaimer............................21 
     17 Full Copyright Statement....................................21 
     18 Authors' Addresses..........................................22 
      
   1 Conventions used in this document 
      

    
  Nadeau, et al.           Expires January 2005                 [Page 2]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL 
     NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" 
     in this document are to be interpreted as described in RFC 2119. 
      
   2 Contributors 
      
     Thomas D. Nadeau, tnadeau@cisco.com 
      
     Monique Morrow, mmorrow@cisco.com 
      
     Peter B. Busschbach, busschbach@lucent.com 
      
     Mustapha Aissaoui, mustapha.aissaoui@alcatel.com 
      
     Matthew Bocci, matthew.bocci@alcatel.co.uk 
      
     David Watkinson, david.watkinson@alcatel.com 
      
     Yuichi Ikejiri, y.ikejiri@ntt.com 
      
     Kenji Kumaki, kekumaki@kddi.com   
         
     Satoru Matsushima, satoru@ft.solteria.net  
      
      
   3 Scope 
      
     This document specifies the mapping of defect states between a 
     Pseudo Wire and Attachment Circuits (AC) of the end-to-end 
     emulated service.  This document covers the case of PW and ACs of 
     the same type in accordance to the PWE3 architecture [PWEARCH]. 
       
     This document covers both PWE over MPLS PSN and PWE over IP PSN.  
          
      
   4 Terminology 
      
        AIS   Alarm Indication Signal  
        AOM   Administration, Operation and Maintenance  
        BDI   Backward Defect Indication  
        CC    Continuity Check  
        CE    Customer Edge  
        CPCS  Common Part Convergence Sublayer  
        DLC   Data Link Connection  
        FDI   Forward Defect Indication   
        FRBS  Frame Relay Bearer Service  
        IWF   Interworking Function  
        LB    Loopback  
        NE    Network Element  
        OAM   Operations and Maintenance  
        PE    Provider Edge  
        PW    Pseudowire  
        PSN   Packet Switched Network  
    
  Nadeau, et al.           Expires January 2005                 [Page 3]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
        RDI   Remote Defect Indicator  
        SDU   Service Data Unit  
        VCC   Virtual Channel Connection  
        VPC   Virtual Path Connection  
           
     The rest of this document will follow the following convention:  
          
     If LSP-Ping is run over a PW as described in [VCCV] it will be 
     referred to as VCCV-Ping.  
         
     If BFD is run over a PW as described in [VCCV] it will be referred 
     to as VCCV-BFD.  
      
   5 Introduction 
      
     This document describes how PW defects can be detected; how alarm 
     information is exchanged between PEs; and how defects detected in 
     pseudo-wires are mapped to OAM messages native to the emulated 
     services and vice versa.  
          
     The objective of this document is to standardize the behavior of 
     PEs with respects to failures on PWs and ACs, so that there is no 
     ambiguity about the alarms generated and consequent actions 
     undertaken by PEs in response to specific failure conditions.  
      
   6 Reference Model and Defect Locations 
      
     Error! Reference source not found.Figure 1 illustrates the PWE3 
     network reference model with an indication of the possible defect 
     locations. This model will be referenced in the remainder of this 
     document for describing the OAM procedures.                       
           
                 ACs             PSN tunnel               ACs 
                        +----+                  +----+ 
        +----+          | PE1|==================| PE2|          +----+ 
        |    |---(a)---(b)..(c)......PW1..(d)..(c)..(f)---(e)---|    | 
        | CE1|   (N1)   |    |                  |    |    (N2)  |CE2 | 
        |    |----------|............PW2.............|----------|    | 
        +----+          |    |==================|    |          +----+ 
             ^          +----+                  +----+          ^ 
             |      Provider Edge 1         Provider Edge 2     | 
             |                                                  | 
             |<-------------- Emulated Service ---------------->| 
       Customer                                                Customer 
        Edge 1                                                  Edge 2 
                 Figure 1: PWE3 Network Defect Locations 
      
     The following is a brief description of the defect locations: 
      
     (a)  Defect in the first L2 network (N1). This covers any defect 
          in the N1 which impacts all or a subset of ACs terminating in 

    
  Nadeau, et al.           Expires January 2005                 [Page 4]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
          PE1. The defect is conveyed to PE1 and to the remote L2 
          network (N2) using a L2 specific OAM defect indication. 
     (b)  Defect on a PE1 AC interface. 
     (c)  Defect on a PE PSN interface. 
     (d)  Defect in the PSN network. This covers any defect in the PSN 
          which impacts all or a subset of the PSN tunnels and PWs 
          terminating in a PE. The defect is conveyed to the PE using a 
          PSN and/or a PW specific OAM defect indication. Note that 
          control plane, i.e., signaling and routing, messages do not 
          necessarily follow the path of the user plane messages. 
          Defect in the control plane are detected and conveyed 
          separately through control plane mechanisms. However, in some 
          cases, they have an impact on the status of the PW as 
          explained in the next section. 
     (e)  Defect in the second L2 network (N2). This covers any defect 
          in N2 which impacts all or a subset of ACs terminating in 
          PE2. The defect is conveyed to PE2 and to the remote L2 
          network (N1) using a L2 specific OAM defect indication. 
     (f)  Defect on a PE2 AC interface. 
      
      
   7 PW Status and Defects 
      
     This section describes possible PW defects, ways to detect them 
     and consequent actions. 

   7.1 PW Defects  
       
     Possible defects that impact PWs are the following.     
          
     . Physical layer defect in the PSN interface 
      
     . PSN tunnel failure which results in a loss of connectivity 
     between ingress and egress PE  
         
     . Control session failures between ingress and egress PE  
          
     In case of a MPLS PSN there are additional defects:  
          
     . PW labeling error, which is due to a defect in the ingress PE,or 
     to an over-writing of the PW label value somewhere along the LSP 
     path.  
          
     . LSP tunnel Label swapping errors or LSP tunnel label merging 
     errors in the MPLS network. This could result in the termination 
     of a PW at the wrong egress PE.  
      
     . Unintended self-replication; e.g., due to loops or denial-of-
     service attacks.  
          


    
  Nadeau, et al.           Expires January 2005                 [Page 5]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
   7.1.1 Packet Loss  
       
     Persistent congestion in the PSN or in a PE could impact the 
     proper operation of the emulated service.  
      
     A PE can detect packet loss resulting from congestion through 
     several methods. If a PE uses the sequence number field in the 
     PWE3 Control Word for a specific Pseudo Wire [PWEARCH], it has the 
     ability to detect packet loss. [CONGESTION] discusses other 
     possible mechanisms to detect congestion between PWs.  
      
     Generally, there are congestion alarms which are raised in the 
     node and to the management system when congestion occurs. The 
     decision to declare the PW Down and to re-signal it through 
     another path is usually at the discretion of the network operator. 

   7.2 Defect Detection  

   7.2.1 Defect Detection Tools  
       
     To detect the defects listed in 7.1, Service Providers have a 
     variety of options available:  
          
     Physical Layer defect detection mechanisms such as SONET/SDH LOS, 
     LOF,and AIS/FERF. 
      
     PSN Defect Detection Mechanisms:  
          
     For PWE3 over an IP PSN, with L2TP as encapsulation protocol, the 
     defect detection mechanisms described in [L2TPv3] apply. 
     Furthermore, the tools Ping and Traceroute, based on ICMP Echo 
     Messages apply [ICMP].  
          
     For PWE3 over an MPLS PSN, several tools can be used.  
     . LSP-Ping and LSP-Traceroute( [LSPPING]) for LSP tunnel 
     connectivity verification. 
      
     . LSP-Ping with Bi-directional Forwarding Detection ([BFD]) for 
     LSP tunnel continuity checking. 
      
     .Furthermore, if RSVP-TE is used to setup the PSN Tunnels between 
     ingress and egress PE, the hello protocol can be used to detect 
     loss of connectivity (see [RSVP-TE]), but only at the control 
     plane. 
      
     PW specific defect detection mechanisms:  
          
     [VCCV] describes how LSP-Ping and BFD can be used over individual 
     PWs for connectivity verification and continuity checking 
     respectively. When used as such, we will refer to them as VCCV-
     Ping and VCCV-BFD respectively.     

    
  Nadeau, et al.           Expires January 2005                 [Page 6]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
   7.2.2 Defect Detection Mechanism Applicability  
       
     The discussion below is intended to give some perspective how 
     tools mentioned in the previous section can be used to detect 
     failures.   
          
     Observations:  
          
     . Tools like LSP-Ping and BFD can be run periodically or on 
     demand. If used for defect detection, as opposed to diagnostic 
     usage, they must be run periodically.  
          
     . Control protocol failure indications, e.g. detected through L2TP 
     Keep-alive messages or the RSVP-TE Hello messages, can be used to 
     detect many network failures. However, control protocol failures 
     do not necessarily coincide with data plane failures. Therefore, a 
     defect detection mechanism in the data plane is required to 
     protect against all potential data plane failures. Furthermore, 
     fault diagnosis mechanisms for data plane failures are required to 
     further analyze detected failures. 
          
     . For PWE3 over an MPLS PSN, it is effective to run a defect 
     detection mechanism over a PSN Tunnel frequently and run one over 
     every individual PW within that PSN Tunnel less frequently. 
     However in case the PSN traffic is distributed over Equal Cost 
     Multi Paths (ECMP), it may be difficult to guarantee that PSN OAM 
     messages follow the same path as a specific PW. A Service Provider 
     might therefore decide to focus on defect detection over PWs.  
          
     . In MPLS networks, execution of LSP Ping would detect MPLS label 
     errors, since it requests the receiving node to match the label 
     with the original FEC that was used in the LSP set up. BFD can 
     also be used since it relies on discriminators. A label error 
     would result in a mismatch between the expected discriminator and 
     the actual discriminator in the BFD control messages.  
          
     . For PWE3 over an MPLS PSN, PEs could detect PSN label errors 
     through the execution of LSP-Ping. However, use of VCCV is 
     preferred as it is a more accurate detection tool for pseudowires. 
     Furthermore, it can be run using a BFD mode which allows it to be 
     used as a light-weight detection mechanism for PWs. If, due to a 
     label error in the PSN, a PW would be terminated on the wrong 
     egress PE, PEs would detect this through the execution of VCCV. 
     LSP ping and/or LSP trace could then be used to diagnose the 
     detected failure. 
        
     Based on these observations, it is clear that a service provider 
     has the disposal of a variety of tools. There are many factors 
     that influence which combination of tools best meets its needs.  

   7.3 PW Defect Entry and Exit Procedures  
      
    
  Nadeau, et al.           Expires January 2005                 [Page 7]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     PWs can fail in a single direction or in both directions. PEs 
     SHOULD keep track of the status of each individual direction. In 
     other words, a PE SHOULD be able to distinguish between the 
     following states: "PW UP", "PW Transmit Direction Down", "PW 
     Receive Direction Down", "PW Receive and Transmit Down".  
          
     The next two sections discuss under which conditions a PE enters 
     and exits these states. To avoid an unnecessarily complicated 
     description, only the states "PW UP" and "PW DOWN" are discussed 
     without further analysis whether it applies to one or two 
     directions of the PW.    

   7.3.1 PW Down  
       
     A PE will consider a PW down if one of the following occurs  
          
     . It detects a physical layer alarm on the PSN interface over 
     which the PW is riding and cannot re-establish the PW over another 
     PSN interface. 
      
     . It detects loss of connectivity on the PSN tunnel over which the 
     PW is riding and cannot re-establish the PW over another PSN 
     tunnel. This includes label swapping errors and label merging 
     errors. 
      
     . It receives a message from its peer indicating a PW defect, 
     which could be one of the following:  
          
           o PW Status indicating "PW Receive Fault"; "PW Transmit  
             Fault"; or "PW not forwarding"  
                 
           o An L2TP SCCN or CDN message  
                 
           o It detects a loss of PW connectivity, including label 
     errors, through VCCV.  
          
     Note that if the control session between the PEs fails, the PW is 
     torn down and needs to be re-established.    

   7.3.2 PW Up  
       
     When a PE determines that all previously existing failures have 
     disappeared, it SHOULD send a message to its peer to indicate 
     this. E.g. if the original failure was conveyed through a PW 
     Status message, the PE should send a PW Status message indicating 
     "PW Forwarding (clear all failures)"  
          
     When a PE receives a PW Status message indicating "PW Forwarding", 
     while it still considers a PW down, and if all previously existing 
     failures, if any, have disappeared, it SHOULD respond with a PW 
     Status message indicating "PW Forwarding". 
          
    
  Nadeau, et al.           Expires January 2005                 [Page 8]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     For PWE3 over a MPLS PSN, a PE will exit the PW down state when 
     the following conditions are true:  
          
     .  All defects it had previously detected, as described in Section 
     7.3.1, have disappeared, and  
          
     . It has received a PW Status message from its peer indicating "PW 
     Forwarding" 
      
     For a PWE3 over a IP PSN, a PE will exit the PW down state when 
     the following conditions are true: 
      
     .  All defects it had previously detected, as described in Section 
     7.3.1, have disappeared, and  
          
     . A L2TPv3 session is successfully established to carry the PW 
     packets. 
          
     [BFD] and [L2TPv3] define the procedures to exit the PW Down state 
     if the original failure notification was done through BFD or L2TP 
     messages, respectively.  

   7.4 Alarm Messages and Consequent Actions  
       
     When a PE changes the status of a PW to DOWN, it SHOULD inform its 
     peer, by using: 
          
     . For PWE3 on MPLS PSN, PW Status messages as defined in 
     [CONTROL].  
       
     . For PWE3 on IP PSN, L2TPv3 messages Stop Control-Connection  
     Notification (SCCN) and Call Disconnect Notify (CDN) as defined in  
     [L2TPv3]  
          
     Furthermore, in either case, if VCCV-BFD is used, the diagnostic 
     code in the VCCV-BFD Control message can be used to exchange alarm 
     information.  
          
     In general, PW Status messages or L2TP SCCN and CDN should be used 
     to communicate failures. VCCV-BFD alarm indications should only be 
     used in specific cases, as explained in 4.6.  
          
     Both PEs will translate the PW alarms to the appropriate failure 
     indications on the affected ACs. The exact procedures depend on 
     the emulated protocols and will be discussed in the next sections.   
      

   7.5 The Use of PW Status  
       
     This document specifies the use of PW status signaling for the 
     purpose of conveying the status of a PW and attached ACs between 
     PEs.  
    
  Nadeau, et al.           Expires January 2005                 [Page 9]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
      
     At the PW setup, a PE will enter in a negotiation with its remote 
     peer of the use of the PW status by inserting the PW Status TLV in 
     the label mapping message. If the negotiation process results in 
     the usage of the PW status TLV, then the actual PW status is 
     determined by the PW status TLV that was sent within the initial 
     PW label mapping. Subsequent updates of PW status are conveyed 
     through the notification message [CONTROL]. 
      
     PW Status messages are used to report the following defects:  
          
     . Defects detected through defect detection mechanisms in the MPLS 
     PSN 
          
     . Loss of connectivity detected through VCCV-Ping   
          
     . Defects within the PE that result in an inability to forward 
     traffic between ACs and PW  
          
     If the PW defect is related to one forwarding direction only, the 
     PE shall either use "PW Receive Fault" or "PW Transmit Fault". In 
     all other cases it shall use "PW Not Forwarding".  
          
     Besides reporting PW defects, PW status is used to propagate AC 
     defects. When and how to use those messages is dependent on the 
     emulated protocol and will be explained in the subsequent 
     paragraphs (5.3 and 6.3). 

   7.6 The Use of L2TP SCCN and CDN  
          
     [L2TPv3] describes the use of SCCN and CDN messages to exchange 
     alarm information between PEs. Like PW Status, SCCN and CDN 
     messages shall be used to report the following failures:  
          
     . Failures detected through defect detection mechanisms in the IP 
     PSN  
          
     . Failures detected through VCCV (except for VCCV-BFD)  
          
     . Failures within the PE that result in an inability to forward 
     traffic between ACs and PW  
           
     In L2TP, the Set-Link-Info (SLI) message is used to convey 
     failures on the ACs.  

   7.7 The Use of BFD Diagnostic Codes  
       
     [BFD] defines a set of diagnostic codes that partially overlap 
     with failures that can be communicated through PW Status messages 
     or L2TP SCCN and CDN. To avoid ambiguous situations, these 
     messages SHOULD be used for all failures that are detected through 
     means other than BFD.   
    
  Nadeau, et al.           Expires January 2005                [Page 10]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
          
     For VCCV-BFD, therefore, only the following diagnostic codes 
     apply:  
      
     Code   Message   
     ----   ------------------------------ 
     0      No Diagnostic  
     1      Control Detection Time Expired  
     3      Neighbor Signaled Session Down  
     7      Administratively Down  
          
     [VCCV] states that, when used over PWs, the asynchronous mode of 
     BFD should be used. Diagnostic code 2 (Echo Function Failed) does 
     not apply to the asynchronous mode, but to the Demand Mode.  
          
     All other BFD diagnostic codes refer to failures that can be 
     communicated through PW Status or L2TP SCCN and CDN.  
          
     The VCCV-BFD procedures are as follows:  
          
     When the downstream PE (PE1) does not receive control messages 
     from the upstream PE (PE2) during a certain number of transmission 
     intervals (a number provisioned by the operator), it declares that 
     the PW in its receive direction is down. PE1 sends a message to 
     PE2 with H=0 (i.e. "I do not hear you") and with diagnostic code 
     1. In turn, PE2 declares the PW is down in its transmit direction 
     and it uses diagnostic code 3 in its control messages to PE2.   
       
     When a PW is taken administratively down, the PEs will exchange PW  
     Status messages with code "Pseudo Wire Not Forwarding" or L2TP CDN 
     messages with code "Session disconnected for administrative 
     reasons". In addition, exchange of BFD control messages MUST be 
     suspended. To that end, the PEs MUST send control messages with 
     H=0 and diagnostic code 7.  
          
     Note, according to [BFD], control messages with an incorrect   
     discriminator field must be discarded. However, since such an 
     occurrence might be caused by swapped or mismerged LSPs, it would 
     be better if a new diagnostic code were introduced to discriminate 
     between missing control packets and packets with an incorrect 
     discriminator. In other words, in most cases one would communicate 
     PW failures through PW Status messages except for a well-defined 
     set of exceptions where BFD is used. How PW defects that can be 
     detected through the use of BFD or through other means, are mapped 
     to defect indications on the ACs is described in sections 8 and 
     subsequent sections.  
      
          
   8 Frame Relay Encapsulation  

   8.1 Frame Relay Management  
          
    
  Nadeau, et al.           Expires January 2005                [Page 11]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     The management of Frame Relay Bearer Service (FRBS) connections 
     can be accomplished through two distinct methodologies:  
        
     1. Based on ITU-T Q.933 Annex A, Link Integrity Verification 
     procedure, where STATUS and STATUS ENQUIRY signaling messages are 
     sent using DLCI=0 over a given UNI and NNI physical link. [ITU-T 
     Q.933]  
           
     2. Based on FRBS LMI, and similar to ATM ILMI where LMI is common 
     in private Frame Relay networks.  
          
     In addition, ITU-T I.620 addresses Frame Relay loopback, but the 
     deployment of this standard is relatively limited. [ITU-T I.620]  
           
     It is possible to use either, or both, of the above options to 
     manage Frame Relay interfaces. This document will refer 
     exclusively to Q.933 messages.  
          
     The status of any provisioned Frame Relay PVC may be updated 
     through:  
            
     . STATUS messages in response to STATUS ENQUIRY messages, these 
     are mandatory.  
          
     . Optional unsolicited STATUS updates independent of STATUS 
     ENQUIRY (typically under the control of management system, these 
     updates can be sent periodically (continuous monitoring) or only 
     upon detection of specific defects based on configuration.  
           
     In Frame Relay, a DLC is either up or down. There is no 
     distinction between different directions.   

   8.2 Mapping of Defect States from a PW to a Frame Relay AC  
     The following are the OAM procedures for defects in locations (c) 
     and (d) in Figure 1.    
     In case a PE keeps track of the status of individual Frame Relay 
     PVCs (which often, but not necessarily, coincides with the usage 
     of 1-1 encapsulation mode), the following procedures apply:  
          
     When PE1 determines that one or both directions of a PW is down it 
     will indicate this on the corresponding FR ACs by sending Active 
     bit = 0 in the full status report (and optionally in the 
     asynchronous status message), as per Q.933 annex A. In addition, 
     PE1 should send a PW status signaling message, ôPW Not Forwardingö 
     to the remote PE to convey the status of the affected PWs. PE2 
     should in turn generate a full status report with the Active bit = 
     0 (and optionally in the asynchronous status message), as per 
     Q.933 annex A, into N2 for the corresponding FR ACs. 
          
     When the PE determines that the PW is up, it will indicate this on 
     the AC through STATUS messages that indicate that the FR PVCs 
     linked to that PW are active.  
    
  Nadeau, et al.           Expires January 2005                [Page 12]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
   8.2.1 Procedures in FR Port Mode 
      
     In case of pure port mode, STATUS ENQUIRY and STATUS messages are 
     transported transparently over the PW. A PW Failure will therefore 
     result in timeouts at the Frame Relay devices at one or both sites 
     of the emulated interface.  

   8.3 Frame Relay Network and Attachment Circuit Defects   
       
     The following are the OAM procedures for defects in locations (a) 
     and (b) in Figure 1. The handling of a defect in locations (e) and 
     (f) is similar to that of locations (a) and (b) respectively. 
      
     As explained in [CONTROL], if a PE detects that a Frame Relay PVC 
     is "inactive", as defined in [ITU-T Q933] Annex A.5, it will 
     convey this information to its peer using a PW status message. The 
     remote PE SHOULD generate the corresponding errors and alarms on 
     the egress Frame Relay PVC  
      
     For PWE3 over MPLS PSN, a PE that detects or is notified of a 
     defect in locations (a) or (b) MUST change the local status of the 
     corresponding FR ACs to DOWN in PE1 and MUST send a PW Status 
     message indicating both "AC Receive Fault" and "AC Transmit 
     Fault". On reception of this PW status message, the egress PE MUST 
     generate a full status report with the Active bit = 0 (and 
     optionally in the asynchronous status message), as per Q.933 annex 
     A, into N2 for the corresponding FR ACs. 
          
     For PWE3 over IP PSN, a PE that detects or is notified of a defect 
     in locations (a) or (b) MUST change the local status of the 
     corresponding FR ACs to DOWN in PE1 and MUST send an L2TP Set-Link 
     Info (LSI) message with a Circuit Status Attribute Value Pair 
     (AVP) indicating "inactive". On reception of this LSI message, the 
     egress PE MUST generate a full status report with the Active bit = 
     0 (and optionally in the asynchronous status message), as per 
     Q.933 annex A, into N2 for the corresponding FR ACs. 
      
      
   9 ATM Encapsulation  

   9.1 ATM Management  
        
     ATM management and OAM mechanisms are much more evolved than those 
     of Frame Relay.  There are five broad management-related 
     categories, including fault management (FT), Performance 
     management (PM), configuration management (CM), Accounting 
     management (AC), and Security management (SM). ITU-T 
     Recommendation I.610 describes the functions for the operation and 
     maintenance of the physical layer and the ATM layer, that is, 
     management at the bit and cell levels ([ITU-T I.610]). Because of 


    
  Nadeau, et al.           Expires January 2005                [Page 13]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     its scope, this document will concentrate on ATM fault management 
     functions. Fault management functions include the following:  
           
     1) Alarm indication signal (AIS)  
     2) Remote Defect indication (RDI).  
     3) Continuity Check (CC).  
     4) Loopback (LB)  
           
     Some of the basic ATM fault management functions are described as 
     follows: Alarm indication signal (AIS) sends a message in the same 
     direction as that of the signal, to the effect that an error has 
     been detected.  
          
     Remote defect indication (RDI) sends a message to the transmitting 
     terminal that an error has been detected. RDI is also referred to 
     as the far-end reporting failure. Alarms related to the physical 
     layer are indicated using path AIS/RDI. Virtual path AIS/RDI and 
     virtual channel AIS/RDI are also generated for the ATM layer.  
           
     OAM cells (F4 and F5 cells) are used for the control of virtual 
     paths and virtual channels with regard to their performance and 
     availability. F4 cells are used to monitor a VPC, F5 cells for a 
     VCC. OAM cells in the F4 and F5 flows are used for monitoring a 
     segment of the network and end-to-end monitoring. OAM cells in F4 
     flows have the same VPI as that of the connection being monitored. 
     OAM cells in F5 flows have the same VPI and VCI as that of the 
     connection being monitored.  The AIS and RDI messages of the F4 
     and F5 flows are sent to the other network nodes via the VPC or 
     the VCC to which the message refers. The type of error and its 
     location can be indicated in the OAM cells. Continuity check is 
     another fault management function. To check whether a VCC that has 
     been idle for a period of time is still functioning, the network 
     elements can send continuity-check cells along that VCC.  

   9.2 Mapping ATM and PW Defect States 
     In normal, i.e., defect-free, operation, all the types of ATM OAM 
     cells described in Section 9.1 are either terminated at the PE, 
     for OAM segments terminating in the AC endpoint, or transparently 
     carried over the PSN tunnel [PWE3-ATM]. This is referred to as 
     ôinband ATM OAM over PWö and is the default method.  
      
     An optional out-of band method based on relaying the ATM defect 
     state over a PW specific defect indication mechanism is provided 
     for PEÆs which cannot generate and/or transmit ATM OAM cells over 
     the ATM PW. This is referred to as ôOut-of-band ATM OAM over PWö. 
     Note that the out-of-band method assumes that the end-to-end 
     circuit consists of three independent segments, <VCC1, ATM PW, 
     VCC2>, with defect states relayed across the boundary of these 
     segments. An important consequence of this is that when a PE is 
     notified of a defect in the remote ATM network, in the remote AC, 
     or in the PW, it will always generate a F4/F5 AIS message towards 
     the local ATM network and local CE regardless of the stated 
    
  Nadeau, et al.           Expires January 2005                [Page 14]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     direction of the defect. At the same time, the PE should not relay 
     over the PW the defect state of a received F4/F5 RDI from the 
     local CE if it is sourcing a F4/F5 AIS on the same AC towards that 
     CE. These conditions maintain the independence of the three defect 
     loops while relaying the defect states end-to-end. The procedures 
     in sections 9.3.2 and 9.4.2 satisfy these two conditions. 

   9.3 Mapping of Defect States from a PW to a ATM AC  
     The following are the OAM procedures for defects in locations (c) 
     and (d) in Figure 1. 

   9.3.1 Inband ATM OAM over PW 
      
     When PE1 detects a defect in locations (c) or (d) it MUST change 
     the status of the affected PWs to DOWN for the direction of the 
     defect. If both directions of the PW are down or if only the 
     Receive direction of the PW is down, PE1 MUST generate AIS on the 
     affected ACs to convey this status to the ATM network (N1) and CE1 
     [PWE3-ATM]. CE1 will reply with a F4/F5 RDI which gets forwarded 
     by PE1 over the PW. PE2 will receive the RDI message only if the 
     forwards direction of the PW, i.e., PE1-to-PE2, is not affected by 
     the defect. In this case, PE2 MUST forward the RDI message to CE2 
     through the ATM network (N2). 
      
     If only the PW Transmit direction is DOWN at PE1, this is 
     generally detected by PE2 through a PSN or a PW continuity 
     checking or connectivity verification mechanism as explained in 
     Section 7.3.1. PE1 is notified through the return path of that 
     specific mechanism. In this case, PE2 will follow the same 
     procedures described above for a defect in the PW Receive 
     direction. 
      
     When the PW status changes back to UP, a PE MUST cease the 
     generation of the F4/F5 messages on the AC towards the CE. This 
     will result in clearing the AIS or RDI states in the remote PE, in 
     CE1, and in CE2. 

   9.3.2 Out-of-Band ATM OAM over PW 
      
     For PWE3 over MPLS PSN, the following operations MUST be performed 
     when PE1 detects a defect in locations (c) or (d): 
          a. PE1 MUST change the status of the affected PWs to DOWN for 
             the direction of the defect.  
          b. If both directions of the PW are down, PE1 MUST generate a 
             PW status message indicating ôPW not forwardingö.  
          c. If only the Receive direction of the PW is down, PE1 MUST 
             generate a PW status message indicating ôLocal PSN-facing 
             PW (ingress) Receive Faultö.  
          d. PE1 MUST generate a F4/F5 AIS on the affected ACs to 
             convey this status to the ATM network (N1) and CE1 [PWE3-
             ATM].  

    
  Nadeau, et al.           Expires January 2005                [Page 15]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
          e. CE1 replies with a F4/F5 RDI. PE1 MUST terminate the F4/F5 
             RDI since it is sourcing a AIS over the same AC towards 
             CE1.  
          a. On reception of the PW status message, PE2 MUST generate a 
             F4/F5 AIS on the related ATM ACs towards CE2. 
          f. The termination point of the ATM VCC or VPC in the far-end 
             CE, i.e., CE2, generates a F4/F5 RDI in response to the 
             received F4/F5 AIS. PE2 MUST terminate the F4/F5 RDI since 
             it is sourcing a AIS over the same AC towards CE2. 
      
     For PWE3 over IP PSN, the following operations MUST be performed 
     when PE1 detects a defect in locations (c) or (d): 
          a. PE1 MUST change the status of the affected PWs to DOWN for 
             the direction of the defect.  
          b. If both directions of the PW are down, or if only the 
             Receive direction of the PW is down, PE1 MUST send an 
             L2TPv3 SCCN or CDN message. 
          c. PE1 MUST generate a F4/F5 AIS on the affected ACs to 
             convey this status to the ATM network (N1) and CE1 [PWE3-
             ATM].  
          d. CE1 replies with a F4/F5 RDI. PE1 MUST terminate the F4/F5 
             RDI since it is sourcing a AIS over the same AC towards 
             CE1.  
          e. On reception of the SSCN or CDN message, PE2 MUST generate 
             a F4/F5 AIS on the related ATM ACs towards CE2. 
          f. The termination point of the ATM VCC or VPC in the far-end 
             CE, i.e., CE2, generates a F4/F5 RDI in response to the 
             received F4/F5 AIS. PE2 MUST terminate the F4/F5 RDI since 
             it is sourcing a AIS over the same AC towards CE2. 
      
     If only the PW Transmit direction is DOWN at PE1, this is 
     generally detected by PE2 through a PSN or a PW continuity 
     checking or connectivity verification mechanism as explained in 
     Section 7.3.1. PE1 is notified through the return path of that 
     specific mechanism. In this case, PE2 will follow the same 
     procedures described above for a defect in the PW Receive 
     direction. 
      
     When the PW status changes back to UP, a PE MUST cease the 
     generation of the F4/F5 messages on the AC towards the CE. In 
     addition, it MUST generate a PW Status message indicating ôPseudo 
     Wire forwarding (clear all failures)ö for PWE3 over a MPLS PSN. 
     For PWE3 or an IP PSN, the actions are TBD. 
     This will result in clearing the AIS or RDI states in the remote 
     PE, in CE1, and in CE2. 

   9.3.3 Procedures in ATM Port Mode 
          
     In case of transparent mapping,(i.e.: "port mode"),  
     where the PE does not keep track of the status of individual ATM 
     VPCs or VCCs, a PE does not know which VPCs and/or VCCs are 
     active. In such a case there is a need for another defect 
    
  Nadeau, et al.           Expires January 2005                [Page 16]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     indication mechanism on the AC. This is beyond the scope of this 
     document.  

   9.4 ATM Network and Attachment Circuit Defects  
      
     The following are the OAM procedures for defects in locations (a) 
     and (b) in Figure 1. The handling of a defect in locations (e) and 
     (f) is similar to that of locations (a) and (b) respectively. 

   9.4.1 Inband ATM OAM over PW 
      
     PE1 MUST transparently carry the F4/F5 AIS or RDI cells received 
     on the corresponding ATM AC (defect a) or the F4/F5 AIS generated 
     locally (defect b) over the corresponding ATM PW. The termination 
     point of the ATM VCC or VPC in the far-end CE, i.e., CE2, 
     generates a F4/F5 RDI in response to a F4/F5 AIS. PE2 MUST forward 
     the RDI over the PW and PE1 MUST forward it over the corresponding 
     AC. CE1 does not reply to a received F4/F5 RDI message. 

   9.4.2 Out-of-Band ATM OAM over PW 
      
     If PE1 cannot generate and/or transmit ATM OAM cells over the ATM 
     PW, it may use the following procedure. 
          
     For PWE3 over MPLS PSN, the following operations MUST be performed 
     when PE1 receives a F4/F5 AIS or RDI from the ATM network (defect 
     a) or when it detects a defect in the Receive or Transmit 
     direction of the ATM AC (defect b): 
          a. PE1 MUST send a PW Status message indicating "AC Receive 
             Fault" for a received F4/F5 AIS.  
          b. PE1 MUST send a PW status message indicating "AC Transmit 
             Fault" for a received F4/F5 RDI only if it is not sourcing 
             a F4/F5 AIS over the same AC towards CE1.  
          c. PE1 MUST generate a F4/F5 RDI on the related ACs towards 
             CE1 in response to a received F4/F5 AIS only. 
          d. On reception of the PW status message,  PE2 MUST generate 
             a F4/F5 AIS on the related ATM ACs towards CE2. 
          e. The termination point of the ATM VCC or VPC in the far-
             end, i.e., CE2, generates a F4/F5 RDI in response to the 
             received F4/F5 AIS. PE2 MUST terminate the F4/F5 RDI since 
             it is sourcing a AIS over the same AC towards CE2.   
          
     For PEW3 over IP PSN, the following operations MUST be performed 
     when PE1 receives a F4/F5 AIS or RDI from the ATM network (defect 
     a) or when it detects a defect in the Receive or Transmit 
     direction of the ATM AC (defect b): 
          b. PE1 MUST send an L2TP Set-Link Info (LSI) message with a 
             Circuit Status AVP indicating "inactive". In the case of a 
             received F4/F5 RDI, PE1 MUST not generate the LSI message 
             if it is sourcing a F4/F5 AIS over the same AC towards 
             CE1.  

    
  Nadeau, et al.           Expires January 2005                [Page 17]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
          c. PE1 MUST generate a F4/F5 RDI on the related ACs towards 
             CE1 in response to a received F4/F5 AIS only. 
          d. On reception of the L2TP LSI message, PE2 MUST generate a 
             F4/F5 AIS on the related ATM ACs towards CE2. 
          e. The termination point of the ATM VCC or VPC in the far-end 
             CE, i.e., CE2, generates a F4/F5 RDI in response to the 
             received F4/F5 AIS. PE2 MUST terminate the F4/F5 RDI since 
             it is sourcing a AIS over the same AC towards CE2.   

   9.4.3 Procedures in ATM Port Mode 
      
     In case of transparent mapping, ,(i.e.: "port mode"), where the PE 
     does not know which VCCs and/or VPCs are active, AIS/RDI messages 
     are transparently propagated to the remote ATM network without PE 
     intervention for defects in the ATM network (location a). For 
     defects in the PE ATM AC interface ,location b, the PE MUST send a 
     PW-STATUS message to its peer. How the peer propagates that 
     message on its AC is beyond the scope of this document.  
          
   10 SONET Encapsulation (CEP)  
       
     [CEP] discusses how Loss of Connectivity and other SONET/SDH 
     protocol failures on the PW are translated to alarms on the ACs 
     and vice versa. In essence, all defect management procedures are 
     handled entirely in the emulated protocol. There is no need for an 
     interaction between PW defect management and SONET layer defect 
     management.  
          
   11 TDM Encapsulation  
       
     From an OAM perspective, the PSN carrying a TDM PW provides the 
     same function as that of SONET/SDH or ATM network carrying the 
     same low-rate TDM stream. Hence the interworking of defect OAM is 
     similar.  
      
     For structure-agnostic TDM PWs, the TDM stream is to be carried 
     transparently across the PSN, and this requires TDM OAM 
     indications to be transparently transferred along with the TDM 
     data. For structure-aware TDM PWs the TDM structure alignment is 
     terminated at ingress to the PSN and regenerated at egress, and 
     hence OAM indications may need to be signaled by special means. In 
     both cases generation of the appropriate emulated OAM indication 
     may be required when the PSN is at fault. 
      
     Since TDM is a real-time signal, defect indications and 
     performance measurements may be classified into two classes, 
     urgent and deferrable. Urgent messages are those whose contents 
     may not be significantly delayed with respect to the TDM data that 
     they potentially impact, while deferrable messages may arrive at 
     the far end delayed with respect to simultaneously generated TDM 
     data. For example, a forward indication signifying that the TDM 
     data is invalid (e.g. TDM loss of signal, or MPLS loss of packets) 
    
  Nadeau, et al.           Expires January 2005                [Page 18]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     is only of use when received before the TDM data is to be played 
     out towards the far end TDM system. It is hence classified as an 
     urgent message, and we can not delegate its signaling to a 
     separate maintenance or management flow. On the other hand, the 
     forward loss of multiframe synchronization, and most reverse 
     indications do not need to be acted upon before a particular TDM 
     frame is played out.  
      
     From the above discussion it is evident that the complete solution 
     to OAM for TDM PWs needs to have at least two, and perhaps three 
     components. The required functionality is transparent transfer of 
     native TDM OAM and urgent transfer of indications (by flags) along 
     with the impacted packets. Optionally there may be mapping between 
     TDM and PSN OAM flows. 
      
     TDM AIS generated in the TDM network due to a fault in that 
     network is generally carried unaltered, although the TDM 
     encapsulations allow for its suppression for bandwidth 
     conservation purposes. Similarly, when the TDM loss of signal is 
     detected at the PE, it will generally emulate TDM AIS.  
      
     SAToP and the two structure-aware TDM encapsulations have 
     converged on a common set of defect indication flags in the PW 
     control word. When the PE detects or is informed of lack of 
     validity of the TDM signal, it raises the local ("L") defect flag, 
     uniquely identifying the defect as originating in the TDM network. 
     The remote PE must ensure that TDM AIS is delivered to the remote 
     TDM network. When the defect lies in the MPLS network, the remote 
     PE fails to receive packets. The remote PE generates TDM AIS 
     towards its TDM network, and in addition raises the remote defect 
     ("R") flag in its PSN-bound packets, uniquely identifying the 
     defect as originating in the PSN. Finally, defects in the remote 
     TDM network that cause RDI generation in that network, may 
     optionally be indicated by proper setting of the field of valid 
     packets in the opposite direction. 
          
   12 Ethernet Encapsulation  
          
     At this point in time, Ethernet OAM is not defined. Therefore, the 
     procedures for mapping PW failures to Ethernet OAM messages and 
     vice versa are currently rudimentary.   
          
     When an ingress PE detects that an Ethernet AC is down (because 
     the related ethernet physical interface is down), it SHOULD send a 
     PW Status message indicating both "AC Receive Fault" and "AC 
     Transmit Fault".  
          
     If an egress PE determines that all ACs on a specific ethernet 
     physical interface are affected (either because of ingress AC 
     failures or because of PW failures), it MAY propagate these alarms 
     by bringing the entire physical interface down. 
      

    
  Nadeau, et al.           Expires January 2005                [Page 19]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
   13 Security Considerations 
      
     The mapping messages described in this document do not change the 
     security functions inherent in the actual messages.  
          
   14 Acknowledgments  
          
     Hari Rakotoranto, Eric Rosen, Mark Townsley, Michel Khouderchah,  
     Bertrand Duvivier, Vanson Lim and Chris  Metz Cisco Systems 
      
   15 References 
      
     [BFD] Katz, D., Ward, D., "Bidirectional Forwarding Detection", 
          Internet Draft <draft-katz-ward-bfd-02.txt>, May 2004  
          
     [CEP] Malis, A., et.al., "SONET/SDH Circuit Emulation over Packet 
          (CEP)", Internet Draft <draft-ietf-pwe3-sonet-08.txt>, June 
          2004  
          
     [CONGESTION] Rosen, E., Bryant, S., Davie, B., "PWE3 Congestion 
          Control Framework", Internet Draft <draft-rosen-pwe3-
          congestion-01.txt", March 2004  
          
     [CONTROL] Martini, L., Rosen, E., Smith, T., "Pseudowire Setup and 
          Maintenance using LDP", Internet Draft <draft-ietf-pwe3-
          control-protocol-08.txt>, July 2004  
          
     [ICMP] Postel, J. "Internet Control Message Protocol" RFC 792  
      
     [ITU-T I.610] Recommendation I.610 "B-ISDN operation and 
          maintenance principles and functions", February 1999  
          
     [ITU-T I.620] Recommendation I.620 "Frame relay operation and 
          maintenance principles and functions", October 1996  
          
     [ITU-T Q.933] Recommendation Q.933 " ISDN Digital Subscriber 
          Signalling System No. 1 (DSS1) “ Signalling specifications 
          for frame mode switched and permanent virtual connection 
          control and status monitoring" February 2003  
              
     [L2TPv3] Lau, J., et.al. " Layer Two Tunneling Protocol (Version 
          3", Internet Draft <draft-ietf-l2tpext-l2tp-base-14.txt>, 
          June 2004  
          
     [LSPPING] Kompella, K., Pan, P., Sheth, N., Cooper, D., Swallow, 
          G., Wadhwa, S., Bonica, R., " Detecting MPLS Data Plane 
          Failures", Internet Draft < draft-ietf-mpls-lsp-ping-06.txt>, 
          July 2004  
          
     [OAM REQ] T. Nadeau et.al., "OAM Requirements for MPLS Networks", 
          Internet Draft <draft-ietf-mpls-oam-requirements-02>, June 
          2003  
       
    
  Nadeau, et al.           Expires January 2005                [Page 20]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     [PWEARCH] Bryant, S., Pate, P., "PWE3 Architecture", Internet 
          Draft, < draft-ietf-pwe3-arch-07.txt>, March 2004  
          
     [PWEATM] Martini, L., et al., "Encapsulation Methods for Transport 
          of ATM Cells/Frame Over IP and MPLS Networks", Internet Draft 
          <draft-ietf-pwe3-atm-encap-06.txt>, July 2004  
          
     [PWREQ] Xiao, X., McPherson, D., Pate, P., "Requirements for   
          Pseudo Wire Emulation Edge to-Edge (PWE3)", < draft-ietf-
          pwe3-requirements-08.txt>, December 2003  
       
     [RSVP-TE] Awduche, D., et.al. " RSVP-TE: Extensions to RSVP for 
          LSP Tunnels", RFC 3209  
          
     [VCCV] Nadeau, T., et al."Pseudo Wire Virtual Circuit Connection 
          Verification (VCCV)", Internet Draft <draft-ietf-pwe3-vccv-
          03.txt>, October 2004. 
      
      
   16 Intellectual Property Disclaimer 
      
     The IETF takes no position regarding the validity or scope of any 
     intellectual property or other rights that might be claimed to 
     pertain to the implementation or use of the technology described 
     in this document or the extent to which any license under such 
     rights might or might not be available; neither does it represent 
     that it has made any effort to identify any such rights.  
     Information on the IETF's procedures with respect to rights in 
     standards-track and standards-related documentation can be found 
     in BCP-11. Copies of claims of rights made available for 
     publication and any assurances of licenses to be made available, 
     or the result of an attempt made to obtain a general license or 
     permission for the use of such proprietary rights by implementers 
     or users of this specification can be obtained from the IETF 
     Secretariat.  
           
     The IETF invites any interested party to bring to its attention 
     any copyrights, patents or patent applications, or other 
     proprietary rights which may cover technology that may be required 
     to practice this standard.  Please address the information to the 
     IETF Executive Director. 
      
      
   17 Full Copyright Statement 
      
     "Copyright (C) The Internet Society (2004). Except as set forth 
     below, authors retain all their rights. 
      
     This document and translations of it may be copied and furnished 
     to others, and derivative works that comment on or otherwise 
     explain it or assist in its implementation may be prepared, 
     copied, published and distributed, in whole or in part, without 
     restriction of any kind, provided that the above copyright notice 
    
  Nadeau, et al.           Expires January 2005                [Page 21]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     and this paragraph are included on all such copies and derivative 
     works.  However, this document itself may not be modified in any 
     way, such as by removing the copyright notice or references to the 
     Internet Society or other Internet organizations, except as needed 
     for the purpose of developing Internet standards in which case the 
     procedures for rights in submissions defined in the IETF Standards 
     Process must be followed, or as required to translate it into 
     languages other than English. 
      
     The limited permissions granted above are perpetual and will not 
     be revoked by the Internet Society or its successors or assigns. 
      
     This document and the information contained herein is provided on 
     an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/S HE 
     REPRESENTS (IF ANY), THE INTERNET SOCIETY AND THE INTERNET 
     ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR 
     IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF 
     THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED 
     WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. 
      
      
   18 Authors' Addresses 
      
     Thomas D. Nadeau 
     Cisco Systems, Inc. 
     300 Beaverbrook Drive 
     Boxborough, MA 01824 
     Phone: +1-978-936-1470 
     Email: tnadeau@cisco.com 
      
     Monique Morrow 
     Cisco Systems, Inc. 
     Glatt-com 
     CH-8301 Glattzentrum 
     Switzerland 
     Email: mmorrow@cisco.com 
      
     Peter B. Busschbach  
     Lucent Technologies  
     67 Whippany Road              
     Whippany, NJ, 07981           
     Email: busschbach@lucent.com 
      
     Mustapha Aissaoui 
     Alcatel 
     600 March Rd 
     Kanata, ON, Canada. K2K 2E6 
     Email: mustapha.aissaoui@alcatel.com 
      
     Matthew Bocci 
     Alcatel 
     Voyager Place, Shoppenhangers Rd 
     Maidenhead, Berks, UK SL6 2PJ 
    
  Nadeau, et al.           Expires January 2005                [Page 22]  
   
  Internet Draft    draft-ietf-pwe3-oam-msg-map-00.txt         July 2004 
   
     Email: matthew.bocci@alcatel.co.uk 
      
     David Watkinson 
     Alcatel 
     600 March Rd 
     Kanata, ON, Canada. K2K 2E6 
     Email: david.watkinson@alcatel.com 
   
     Yuichi Ikejiri                                       
     NTT Communications Corporation                   
     1-1-6, Uchisaiwai-cho, Chiyoda-ku   
     Tokyo 100-8019, JAPAN                               
     Email: y.ikejiri@ntt.com 
      
     Kenji Kumaki 
     KDDI Corporation              
     KDDI Bldg. 2-3-2             
     Nishishinjuku, Shinjuku-ku   
     Tokyo 163-8003,JAPAN                         
     E-mail : kekumaki@kddi.com   
         
     Satoru Matsushima                   
     Japan Telecom                       
     JAPAN                               
     Email: satoru@ft.solteria.net 
      



























    
  Nadeau, et al.           Expires January 2005                [Page 23]  

